Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེ་ཕྱིར་སྲིན་མོ་བོང་མོས་བླངས།
en: The rākṣasī Female Donkey took him with her

source: །གངས་ཀྱི་གནས་སུ་སོང་ནས་སུ།
en: And brought him to her dwelling place in the snow mountains,

source: །བུ་ལ་ཆགས་པས་གསོས་པ་ཡིན།
en: Where she raised him lovingly as if he were her own son.

source: །བཅུད་ཀྱིས་ལེན་ནི་འཐུངས་པས་ན།
en: “Since she made him drink rejuvenating elixir,

source: །དེ་ཚེ་ལྷ་དང་ལྷན་ཅིག་འགྲོགས།
en: He spent his time in the company of the gods.

source: །ཤེས་རབ་ཆེན་པོ་སྐལ་ལྡན་པོ།
en: He acquired great insight and became skilled,

source: །རབ་ཏུ་བརྩོན་ལྡན་སྙིང་རྗེའི་སེམས།
en: Diligent, and compassionate.

source: །གཟི་བརྗིད་ཆེན་པོ་བྱམས་པ་ཐོབ།
en: “He developed great majesty and love,

source: །སེམས་ཅན་ཀུན་ལ་ཕན་བྱེད་པའོ།
en: And he benefitted all sentient beings.

source: ལྷ་ཡི་ཚོགས་ཀྱང་འདུས་ནས་སུ། །
en: Hosts of gods gathered together

source: རྔ་བོང་ལ་ནི་ཕྱག་འཚལ་ནས། །
en: And paid homage to Uṣṭra.

source: དེ་ལ་ཡང་ནི་སྙིང་བརྩེའི་ཕྱིར། །གངས་ཀྱི་རི་བོ་སྤྲུལ་པ་བྱས། །
en: “Out of affection for him, They manifested a snow mountain

source: ཤིང་དང་མེ་ཏོག་འབྲས་བུར་ལྡན། །
en: Covered with trees filled with flowers and fruits.

source: དྲི་ཞིམ་དགའ་བར་བྱེད་པ་སྟེ། །
en: It was fragrant and delightful,

source: སྣ་ཚོགས་རྩི་ཡིས་ཁེབས་པ་ལ། །བྱ་རྣམས་སྣ་ཚོགས་རྟེན་པ་ཡིན། །
en: “All kinds of plants were growing on it, And it was home to many types of birds.

source: དེར་ནི་དྲང་སྲོང་རྔ་བོང་དེ། །རྣམ་པར་དབེན་པར་རྟེན་ནས་སུ། །
en: For sixty thousand years the sage Uṣṭra Resided there in isolation.

source: ལོ་ནི་དྲུག་ཁྲི་ཐམ་པར་ཡང་། །རྐང་པ་གཅིག་གིས་དཀའ་ཐུབ་གནས། །
en: “He engaged in the ascetic practice Consisting in standing on one foot.

source: བརྒྱ་བྱིན་ཚངས་པས་ཕྱག་བྱས་ཏེ། །
en: Śakra and Brahmā paid homage to him,

source: ལྷ་རྣམས་ཀུན་གྱིས་མངོན་པར་བསྟོད། །
en: And all the gods openly praised him.

source: གཟུགས་རྟེན་ལྷ་རྣམས་ཐམས་ཅད་དང་། །དེར་ནི་ཚངས་པ་ཉེ་བར་འོངས། །འདོད་རྟེན་ལྷ་རྣམས་ཐམས་ཅད་དང་། །དེར་ནི་བརྒྱ་བྱིན་ཉེ་བར་འོངས། །
en: “All the gods of the form realm, Led by Brahmā, approached him. As did all the gods of the desire realm, Led by Śakra.

source: ཀླུ་དང་གནོད་སྦྱིན་གྲུལ་བུམ་དག །ཐམས་ཅད་དེར་ནི་ཉེ་བར་ལྷགས། །འཇིག་རྟེན་གང་སུ་མཁས་པ་ནི། །དྲང་སྲོང་ཚངས་པར་སྤྱོད་པ་རྣམས། །
en: “All the nāgas, yakṣas, and kumbhāṇḍas Also came close to him, As did all the wise ones within the world— The sages practicing pure conduct

source: འདོད་པའི་ཁམས་དང་གཟུགས་ཁམས་པ། །ཐམས་ཅད་དེར་ནི་ཉེ་བར་ལྷགས། །
en: “And all the beings residing In the desire and form realms.

source: ཀུན་གྱིས་དྲང་སྲོང་རྔ་བོང་ལ། །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱས། །
en: They all worshiped the sage Uṣṭra With a variety of offerings.

source: བཏུད་ནས་ཐལ་མོ་སྦྱར་བྱས་ཏེ། །བརྒྱ་བྱིན་ཚངས་པས་འདི་སྐད་སྨྲས། །
en: “Bowing with their palms joined, Śakra and Brahmā asked him,

source: སྐལ་ལྡན་ཆེན་པོ་ཀྱེ་ཁྱོད་ནི། །ཅི་ཕྱིར་དེད་ལ་མངོན་པར་དགའ། །རེ་བ་ཅི་འདྲ་ཅི་ལ་བསམས། །ཅི་འདོད་པ་ནི་སྨྲ་བར་གྱིས། །
en: ‘O excellent being, How may we please you, Guide? “ ‘What are your expectations and intentions? Please tell us what you want!’

source: དྲང་སྲོང་རྔ་བོང་གིས་སྨྲས་པ། །གཟའ་དང་རྒྱུ་སྐར་སྐར་མ་རྣམས། །མཁའ་ལ་ཅི་འདྲར་བྱུང་གྱུར་པའི། །སྔོན་གྱི་བསྐལ་པ་བདག་གིས་དྲན། །
en: The sage Uṣṭra replied, ‘I remember how the planets, lunar mansions, and stars “ ‘Appeared in the sky During the previous eons.

source: ཉིན་ཞག་དུ་ནི་རྒྱུ་སྐར་རྣམས། །རེ་རེ་ནས་ནི་རྒྱུ་བར་བྱེད། །
en: Each day, the lunar mansions Change from one to the other.

source: ཚེ་རབས་ཀུན་ཏུ་རྒྱུ་སྐར་གྱི། །ཡོན་ཏན་ལས་རྣམས་རྣམ་པར་ཤེས། །
en: “ ‘In all my lives, I have known The qualities and activities of the lunar mansions.’

source: བསྐལ་པ་བཟང་པོ་འདི་ལ་ནི། །འདི་ནི་ཅི་ཡང་མི་སྣང་ན། །སྙིང་བརྩེར་གྱིས་དེ་ཁྱོད་ཀྱིས་ནི། །རྒྱུ་སྐར་གོ་རིམས་ཀུན་ཞོག་ཤིག །ཇི་ལྟར་འཇིག་རྟེན་འདིར་གནས་བཞིན། །དེ་ཡི་ལས་དང་ཡོན་ཏན་གསུངས། །ཡོན་ཏན་རྒྱ་མཚོས་ཤོད་ཅིག་ཅེས། །ལྷ་ཡི་ཚོགས་རྣམས་ཀུན་གྱིས་སྨྲས། །
en: All the hosts of gods then said, ‘In this excellent eon, “ ‘This knowledge has disappeared. Please kindly present to us The sequence of the lunar mansions! Please tell us about their activities and qualities “ ‘While they remain in this world! Ocean of qualities, please explain this to us!’

source: དྲང་སྲོང་རྔ་བོང་གིས་སྨྲས་པ། །རེ་ཞིག་དང་པོར་སྨིན་དྲུག་ཅེས། །
en: “The sage Uṣṭra replied, ‘First of all, there is the lunar mansion called Kṛttikā. [. . .]

source: ཡང་དེའི་ཚེ་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་ག་ལ་བར་ཀླུ་ཐམས་ཅད་འདུས་ཏེ། དེ་དག་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་མཆོག་ཏུ་བླ་མ་ལ་གུས་པ་དང་གཅེས་པར་བྱེད་པ་སྐྱེས་ཏེ། དེ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ཅི་ནུས་སུ་བརྩོན་པར་གྱུར་ཏོ། །
en: At this point all the nāgas gathered at the sacred site of wise sages developed respect and appreciation for the supreme teacher, the sage Jyotīrasa, and diligently worshiped him to the best of their abilities.

source: འཕགས་པ་འདུས་པ་ཆེན་པོའི་སྡེ་ཐེག་པ་ཆེན་པོའི་མདོ་ལས་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་རྫོགས་ཏེ། རྒྱུ་སྐར་གྱི་སྦྱོར་བ་རྣམ་པར་གཞག་པའི་ལེའུ་སྟེ་བདུན་པ་རྫོགས་སོ།། །།འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ། བམ་པོ་བཅུ་གཅིག་པ།
en: This concludes the chapter called “The Presentation of the Conjunctions of the Lunar Mansions,” the seventh among the eleven chapters included in “The Quintessence of the Sun,” the Great Vehicle discourse of The Great Assembly.

source: རྒྱ་མཚོས་སྨྲས་པ། ནམ་མཁའ་ལ་ནི་རྒྱུ་སྐར་ཚོགས། །ཇི་ལྟར་བཞག་པ་བཞིན་དུ་ནི། །ཁྱོད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་དྲན། །མཁས་ཁྱོད་སྲིད་གསུམ་ཀུན་གྱི་གཙོ། །ཁྱོད་ཀྱི་སྙིང་རྗེ་བྱམས་པ་དཔེར། །ཤེས་གསལ་འགྲོ་ལ་སྙིང་བརྩེ་བཞིན། །ཀུན་དཔལ་འདི་ནས་ཁྱོད་ཀྱིས་ནི། །ལག་འགྲོ་ཐམས་ཅད་ཐར་བར་གྱིས། །
en: Sāgara then said: “You remember past lives Based on the placement of the lunar mansions in the sky. Wise one, leader of the three realms, Clear-minded one, glorious being, “As an example of your love and compassion, And in accordance with your affection for everyone, Please liberate all the nāgas from this place!

source: སྲིད་གསུམ་ཚུལ་བརྟུལ་མཚུངས་མེད་ཁྱོད། །
en: Your discipline and observances “Are unmatched in the three realms.

source: ལག་འགྲོ་དེ་ཀུན་ཚིམ་བྱེད་ཁྱོད། །ཁྱོད་ནི་དྲང་སྲོང་ཀུན་གྱི་བླ། །མི་རྣམས་ཀྱིས་ནི་མཆོད་པར་འོས། །
en: You bring satisfaction to all the nāgas. You are the master of all sages, And you are worthy to be worshiped by the humans.

source: འགྲོ་བ་ཀུན་དཔལ་ཁྱོད་ལ་ནི། །ལྷ་དང་ལག་འགྲོ་གནོད་སྦྱིན་ཚོགས། །རྟེན་གྱི་ཡུལ་རྣམས་ཐམས་ཅད་པ། །ལག་འགྲོ་མྱུར་དུ་ཐར་བར་གྱིས། །
en: “Most glorious of all beings, Please quickly liberate the nāgas And all those groups of gods, nāgas, and yakṣas Who attend upon you!”

source: དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་དཀོན་མཆོག་གསུམ་ལ་མཆོག་ཏུ་ཡིད་དང་བ་བསྐྱེད་པར་འདོད་ནས་དེ་ལྟ་བུའི་ཀླུའི་ཚོགས་ཐམས་ཅད་ལ་ཤིན་ཏུ་རིགས་པའི་ཚིག་སྙན་པ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: With a wish to induce strong faith in the Three Jewels, the sage Jyotīrasa then uttered these appropriate and sweet-sounding words to all those groups of nāgas:

source: །ཡོན་ཏན་དེ་འདྲ་བདག་ལ་མེད།
en: “I do not possess such qualities!

source: །དྲང་སྲོང་རྔ་བོང་བདག་མ་ཡིན། །ཁྱེད་ཅག་འདི་ནས་ཐར་བྱེད་པར། །བདག་གིས་ནུས་པ་མ་ཡིན་ནོ།
en: I am not the sage Uṣṭra. I do not have the power To liberate you from this place.

source: །གང་གིས་བསྐལ་པ་དུ་མར་ནི། །དཀའ་ཐུབ་དཀའ་བ་བཟོད་པ་སྤྱད།
en: “You should look for the other sage, Who for many eons Has undergone austerities and hardships.

source: །ཁྱོད་ཅག་ཐར་བར་བྱེད་པ་ཡི། །
en: He will be able to liberate you.

source: དྲང་སྲོང་གཞན་དེ་བལྟ་བར་གྱིས། །རྟག་ཏུ་བརྩོན་ཞིང་སྦྱིན་པ་བྱིན།
en: “That sage has always been diligent and practiced generosity.

source: །མཁས་ཤིང་གླང་ཆེན་རྟ་དང་ནི། །ཤིང་རྟ་བུ་དང་ཆུང་མ་དང་། །ནོར་གྱིས་སེམས་ཅན་ཕན་པ་བྱས།
en: He is wise and has benefited sentient beings Through offerings of elephants, horses, Chariots, sons, wives, and wealth.

source: །རྐང་ལག་མགོ་དང་རྣ་བ་དང་། །མིག་དང་པགས་པ་ཁྲག་དང་ནི། །བུ་བྲན་བྲན་མོ་བཟའ་བཏུང་མང་། །མལ་ཆ་ཁ་ཟས་སྔོན་ཆད་བཏང་།
en: “In the past, he has often given away His limbs, head, ears, eyes, skin, blood, Sons, male and female servants, Food, beverages, bedding, and meals.

source: །སྙིང་རྗེ་དང་ནི་བྱམས་པ་ཡིས། །
en: “He will liberate you through his love and compassion.

source: ཁྱེད་ཅག་ཐར་བྱེད་སྲིད་གསུམ་ན། །མཚུངས་མེད་བསམ་གཏན་དགའ་འབྱུང་བ། །
en: He is unmatched in the three realms, And he revels in concentration.

source: དེ་ནི་དྲང་སྲོང་རྔ་བོང་སྟེ།
en: That sage is named Uṣṭra.

source: །ཀུན་ཏུ་བརྩེ་ཞིང་བྱང་ཆུབ་སེམས།
en: “He is loving and has given rise to the mind set on awakening.

source: །སྔོན་ཆད་རིག་བྱེད་ཕ་རོལ་ཕྱིན།
en: He has mastered the Vedas in the past,

source: །སེམས་ཅན་མང་པོ་སྡུག་བསྔལ་གྱིས། །ཉམ་ཐག་པ་ནི་ཐར་བར་བྱས།
en: And he has liberated many sentient beings Tormented by suffering.

source: །སེམས་ཅན་གཅིག་གི་ཆེད་དུ་ཡང་། །སྔོན་གྱི་ཚེ་རབས་དེ་བསྐལ་པར། །དམྱལ་བར་འགྲོ་བཟོད་དེ་ཡི་དགས།
en: “For the sake of even a single being, He has patiently endured the destinies Of hell beings and pretas during eons in past lives.

source: །དེ་ནི་འཇིག་རྟེན་སངས་རྒྱས་བྱུང་།
en: He is a buddha who has appeared in the world.

source: །སེམས་ཅན་སྡུག་བསྔལ་ཉམ་ཐག་ཀུན། །སྡུག་བསྔལ་མཐར་མཛད་རྔ་བོང་ཡིན།
en: “The one who has liberated all those tormented beings From their sufferings is Uṣṭra.

source: །སེམས་ཅན་སྨན་ཕྱིར་བརྩོན་འགྲུས་དང་། །སྙིང་རྗེ་བརྟན་པོས་དེ་སྲིད་འཁོར། །རྔ་བོང་དེ་ནི་སྐྱེས་པ་ན། །རྒྱལ་སྲས་བུ་རམ་ཤིང་བ་ཡི། །རིགས་སུ་ཟས་གཙང་གི་ནི་སྲས།
en: Due to his firm diligence and compassion, When Uṣṭra was born within saṃsāra “To benefit sentient beings, He was born as a prince, the son of Śuddhodana, In the family of Ikṣvāku.

source: །དེས་ནི་བཙས་མ་ཐག་ཏུ་ཁྱབ། །སྲིད་གསུམ་བདེ་འབྱུང་འཇིག་རྟེན་དཔལ། །ཡིད་བདེ་རྣམ་པ་སྣ་ཚོགས་དང་། །
en: As soon as he was born, “Happiness was felt in the three realms, The world became splendorous, And beings were filled with happiness.

source: ལྷ་དང་ཀླུ་ཡི་བུ་རྣམས་དང་། །འབྱུང་པོ་གནོད་སྦྱིན་རྒྱལ་པོས་ཁྱབ། །དེར་ནི་མཆོད་ཕྱིར་ཐམས་ཅད་ལྷགས།
en: All the kings of the gods, nāgas, bhūtas, and yakṣas “Arrived from all directions to worship the prince.

source: །དེ་ཡིས་གོམ་པ་བདུན་བོར་ཏེ། །རི་དང་རྒྱ་མཚོར་བཅས་པ་ཡི། །ས་ནི་ཐམས་ཅད་འཁྲུགས་པར་གྱུར།
en: He walked seven steps, And this entire earth with its mountains and oceans started to shake. The son of the Śākyas said,

source: །འགྲོ་བ་རྒ་ནད་སྡུག་བསྔལ་དང་། །འཆི་བས་གཟིར་ལས་ངས་བསྒྲལ་ཞིང་། །ཞི་བ་བདེ་བ་མྱ་ངན་མེད། །སྐམ་ལ་དགོད་ཅེས་ཤཱཀ་སྲས་གསུངས།
en: “ ‘I will liberate beings from the torments Caused by old age, sickness, suffering, and death, And I will establish them on the dry shore, Where they will experience peace and happiness and be free from sorrow.’

source: །མེ་ཏོག་དྲི་དང་རིན་ཆེན་དག །ལྷ་ཀླུ་རྣམས་ཀྱིས་གཏོར་གྱུར་ཅིང་། །འབྱུང་པོའི་ཚོགས་རྣམས་སྣ་ཚོགས་ཀྱིས། །སྲས་པོ་ལ་ནི་བསྟོད་གྱུར་པ།
en: “The gods and nāgas tossed Flowers, perfumed substances, and precious gems, And the different groups of bhūtas Praised the prince in these words:

source: །བསྐལ་པ་མང་པོ་དུ་མར་ཡང་། །སྔོན་ཆད་ཁྱོད་ཀྱིས་དུལ་བ་དང་། །སྦྱིན་དང་བསམ་གཏན་དགྱེས་ལ་བརྟེན།
en: “ ‘For many eons in the past, You have joyfully engaged In discipline, generosity, and concentration,

source: །སེམས་ཅན་ཀུན་ཆེད་སྡུག་བསྔལ་བཟོད།
en: And you have patiently endured suffering for the sake of all beings.

source: །འདི་ལ་སྐྱེ་བ་འདི་ཡང་ནི། །ཐམས་ཅད་ཀྱི་ནི་ཐ་མ་ལགས།
en: “ ‘Among all your lives, This birth is your last one.

source: །སྡུག་བསྔལ་ཐམས་ཅད་ཞི་མཛད་པར། །རིང་པོར་མི་ཐོགས་ཁྱོད་འཚང་རྒྱ།
en: Since you have pacified all suffering, You will soon awaken to buddhahood.’

source: །དེས་ཀྱང་དཔའ་བོ་བརྟན་པར་གྱུར། །མཚུངས་པ་མེད་དེ་བུད་མེད་ཚོགས། །
en: “He donned the saffron robes And became peerless.

source: དྲུག་ཁྲི་ཐམ་པ་སྤངས་ནས་སུ། །སྤྱོད་པ་རབ་བསྟན་ལོ་དྲུག་སྤྱད། །
en: After renouncing sixty thousand women, He practiced intense austerities for six years.

source: གཡོ་སྒྱུ་ཅན་ནི་སྡེར་བཅས་པའི། །བདུད་ནི་གཅིག་པུས་བཅོམ་ནས་ཀྱང་།
en: “Alone, he overcame The cunning Māra and his army,

source: །བྱང་ཆུབ་ཞི་མཆོག་གཞལ་མེད་བརྙེས།
en: Reached the boundless, supreme peace of awakening,

source: །མྱ་ངན་མེད་ལམ་དོན་དམ་གཟིགས།
en: And realized the ultimate path devoid of sorrow.

source: །བྱམས་དང་ཡེ་ཤེས་ཐུགས་རྗེ་ཡིས།
en: “His love, wisdom, and compassion

source: །སེམས་ཅན་ཀུན་དང་མི་མཉམ་ཞིང་། །འབྱུང་པོ་དག་ནི་ཐམས་ཅད་ལ། །དེ་ནི་བྱམས་པའི་ཐུགས་མཉམ་པ། །སེམས་ཅན་གང་ལའང་མཐོ་མི་འཚམ།
en: Are unmatched among all sentient beings, And his impartial love Extends to all beings.

source: །སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས། །ཐར་བར་མཛད་ཅིང་དེ་ཡང་ནི།
en: “He does not harm anyone But liberates everyone From their suffering.

source: །རྣམ་བཅིངས་བཙོན་ར་ཐར་མཛད་པ།
en: He frees them from the bondage of their prisons.

source: །མ་ག་དྷཱ་ན་དེ་གནས་ཤིང་།
en: “He resides in Magadha,

source: །འགྲོ་བའི་ནང་ན་ཆོས་ཀྱང་སྟོན།
en: Where he teaches the Dharma among beings.

source: །དེ་ལ་ཁྱོད་ཀྱིས་གསོལ་བ་ཐོབ། །བྱམས་པའི་ཡིད་ཀྱིས་རྣམ་པར་ལྟོས།
en: Supplicate him And behold him with love!

source: །དྲང་སྲོང་མཆོག་གི་ཐད་དུ་དེང་། །འགྲོ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས། །ཁྱེད་ཅག་ཡོངས་སུ་ཐར་བར་བྱེད།
en: “Go meet this supreme sage—He will liberate you From all the sufferings of migration.

source: །རང་ཉིད་ཀྱང་ནི་འདོང་བར་གྱིས།
en: I will also go there myself.

source: །དགའ་མཆོག་བདེ་བ་འདོད་རྣམས་ཀྱིས། །ཕྱིན་ཅད་མཁའ་ལྡིང་ཐམས་ཅད་ལས། །འཇིགས་པ་ཁྱེད་ལ་མི་འབྱུང་ངོ་།
en: “Those among you who wish For supreme joy and happiness Will no longer be afraid of the garuḍas

source: །རྟག་བདེ་སྡུག་བསྔལ་བྲལ་དགར་གྱིས། །བཙོན་ར་འདི་ནི་གཡོ་སྒྱུ་ཅན།
en: But will enjoy permanent happiness and freedom from suffering!

source: །བདུད་ནི་ཁྱེད་ལ་རྣམ་པར་འཚེ།
en: “The cunning Māra is harming you Within this prison.

source: །ཇི་ལྟར་ང་ཡིས་བཤད་པ་བཞིན། །ཐམས་ཅད་ཀྱང་ནི་གཟུང་བར་གྱིས།
en: Remember everything That I have told you!”

source: །ཡང་དེའི་ཚེ་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དུ་ཀླུ་དང་། ཀླུ་ཆེན་པོ་ཕོ་དང་། མོ་དང་། ཁྱེའུ་དང་། བུ་མོ་གང་དག་ཐམས་ཅད་འདུས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཐལ་མོ་རབ་ཏུ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇིག་རྟེན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ། ཆོས་ཐམས་ཅད་ཀྱི་དབང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་སེལ་བར་མཛད་པ། བདེ་བ་ཐམས་ཅད་སྦྱིན་པར་མཛད་པ། དགའ་བ་ཐམས་ཅད་སྐྱེད་པར་མཛད་པ། ཤེས་རབ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། རྟག་ཏུ་བྱམས་པའི་ཐུགས་དང་ལྡན་པ། ཐུགས་རྗེ་ཐམས་ཅད་ཀྱིས་ཁྱབ་པ། ཕྲིན་ལས་ཐམས་ཅད་སྒྲུབ་པར་མཛད་པ། ལམ་ཐམས་ཅད་སྟོན་པ། ཡང་དག་པའི་མིག་གསུང་བ། ལྷ་དང་ཀླུ་རྣམས་ཀྱིས་མཆོད་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: At that moment, all the male, female, boy, and girl nāgas and great nāgas who had gathered at the sacred site of wise sages joined their palms and exclaimed, “We prostrate to the one who is more exalted than the entire world, who has mastered all phenomena, who clears away the suffering of all sentient beings, who bestows all forms of happiness, who generates all kinds of joy, who has perfected all types of insight, who is always loving and filled with compassion, who accomplishes all activities, who reveals all the paths, who teaches the genuine vision, and who is worshiped by the gods and the nāgas!

source: སྲིད་པ་གསུམ་གྱི་དགྲ་བཅོམ་པ། མཆོད་པ་ཐམས་ཅད་འོས་པ། བདག་ཅག་ཐམས་ཅད་སྡུག་བསྔལ་གྱི་བཙོན་ར་འདིར་འཕངས་ལགས་ན་འདི་ནས་བདག་ཅག་ཐར་བར་མཛད་པར་གསོལ།
en: Worthy One of the three realms who deserves everyone’s worship, we have all been thrown into this prison of suffering—please liberate us from this place!

source: ཀླུ་དེ་དག་དང་ལྷན་ཅིག་བདག་ཅག་གནས་པར་བགྱིའོ།
en: We must stay together with those nāgas.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་དེ་དག་ཐམས་ཅད་སྔོན་གྱི་ལུས་ཀྱི་གཟུགས་ཇི་ལྟ་བ་བཞིན་དུ་བཀོད་དེ། གནས་དེ་ནས་འགྲོ་བར་མ་ནུས་སོ།
en: The Blessed One then restored the body of all those nāgas to their previous condition, but they were still unable to leave that place.

source: །དེ་དག་ཐམས་ཅད་ཀྱིས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་ལ་སྨྲས་པ། དེ་བཞིན་གཤེགས་པ་དེ་ནི་བདེན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བར་བཞེད་པ་རྣམ་པར་མི་འཚེ་བའི་ཆོས་ཉིད་ཡིན་ནོ།
en: They all said to the sage Jyotīrasa, “That thus-gone one is genuine—he always seeks the happiness of all beings, and he does not want to harm anyone!

source: །དེ་ལ་བདག་ཅག་སྐྱབས་སུ་ཉེ་བར་གནས་སོ།
en: We want to take refuge in him and stay close to him.

source: །འདི་ནས་མྱུར་དུ་བཞུད་ཅིག །བདུད་ཀྱི་འཆིང་བ་འདི་ལས་བདག་ཅག་ཐར་བར་མཛོད་ཅིག །
en: Please enable us to leave this place quickly! Please liberate us from this bondage of the māras!”

source: སྐར་མ་ལ་དགའ་བས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དྲང་སྲོང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་རྒྱུ་འཐུན་པ་ཐམས་ཅད་མཁྱེན་པ་ཐུབ་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་འཁོར་བའི་འཁོར་ལོ་རྣམ་པར་ལྡོག་པར་བྱ་བའི་ཕྱིར་དང་། བྱང་ཆུབ་ཀྱི་ལམ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་དང་། རྒྱུ་དང་འབྲས་བུའི་སེམས་ཅན་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱི་བར་དུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་མང་པོར་མ་བྱུང་བ་ལ་དམིགས་པ་དང་། ཉན་ཐོས་དང་ཐུན་མོང་བ་སེམས་ཅན་ལ་དམིགས་པའི་གནས་པ་མཆོག་བསྟན་ཏོ།
en: The sage Jyotīrasa replied, “In order to reverse the wheel of saṃsāra for the bodhisattva great beings, to purify the path of awakening, to teach the principle of cause and effect to sentient beings, [. . .] and to cause them to achieve the buddha eye, the Thus-Gone One—the omniscient sage who is the outcome of great compassion aimed at providing welfare and happiness to all beings—has revealed the supreme abodes that focus on what has only rarely occurred and that, in common with the hearers, focus on sentient beings.

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སློབ་དཔོན་ལ་རག་ལས་པ་རྣམས་ལ་རྒྱུ་ལས་ཡང་དག་པར་བྱུང་བ་དང་། སོ་སོར་བརྟགས་པ་ལ་དམིགས་པ་ཚངས་པའི་གནས་པ་བསྟན་ཏོ།
en: For the bodhisattva great beings who attend to teachers, he also taught the sublime states that focus on that which arises from causes and on intellectual analysis.

source: །ད་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གྲངས་མེད་པ་དཔག་ཏུ་མེད་པ་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ན་ཐེག་པ་བླ་ན་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་རྒྱ་མཚོ་ལས་བསྒྲལ་བའི་ཕྱིར་དང་། བདུད་བཞི་གདུལ་བའི་ཕྱིར་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅད་པའི་ཕྱིར་ཆོས་ཀྱི་ཆུས་ཁྲུས་མཛད་དོ།
en: Right now, in countless buddha realms as numerous as all the smallest grains of sand in the Ganges, the Thus-Gone One is using the water of the Dharma to cleanse those bodhisattva great beings who master the six perfections of the unsurpassed vehicle as well as all other beings. He does this in order to free them from the ocean of saṃsāra, to subjugate the four māras, and to ensure that the lineage of the Three Jewels remains uninterrupted.

source: །ད་ལྟར་ཤིན་ཏུ་ཀུན་ཏུ་རྟོག་པའི་ཉོན་མོངས་པའི་ཚོགས་ཀྱི་སེམས་ཅན་གྱི་ཁམས་ལ་དམིགས་པ་མེད་པ། ཀུན་ནས་ལྡང་བ་མེད་པ། རྒྱུ་བ་མེད་པ། གཞི་མེད་པ། མཚན་ཉིད་མེད་པ། མཚན་མ་མེད་པ། ཆགས་པ་མེད་པ། རྣམ་པར་གཞག་པ་མེད་པ། རྡུལ་མེད་པ། མུན་པ་མེད་པ། སྣང་བ་མེད་པ། གཟུང་བ་མེད་པ། གསལ་བྱེད་མེད་པ། སྤྱོད་པ་མེད་པ། ཐ་མི་དད་པ་ཉིད་ཅེས་བྱ་བ་ནས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དང་། འབྱུང་བ་ཆེན་པོ་ཐམས་ཅད་དང་། མིག་གི་རང་བཞིན་ཚོར་བ་པོ་མེད་པའི་སྲེད་པ་ཞེས་བྱ་བའི་བར་ནས། ཡིད་ཀྱི་རང་བཞིན་ཚོར་བ་པོ་མེད་པའི་སྲེད་པའི་བར་ལ་སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་།
en: The Thus-Gone One does not observe the realm of sentient beings who are afflicted by a multitude of conceptual afflictions. He is devoid of arising, movement, basis, characteristics, marks, attachment, determination, substance, darkness, light, apprehension, illumination, activity, and distinction. [. . .] He is devoid of wishes with respect to all the aggregates, the elements, the sense sources, and the great elements, as well as craving with respect to the nature of the eye that is devoid of a subject of experience up to craving with respect to the nature of the mind that is devoid of a subject of experience. He is devoid of formation and engagement.

source: འཇུག་པ་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པའི་མཐའ་དང་། འགག་པ་མེད་པ་དང་། དེ་བཞིན་ཉིད་འདྲེས་པ་མེད་པ་དང་། གང་འཇུག་པ་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་སྒྲོལ་བ། ཕྱད་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་དང་ལྡན་པ།
en: He liberates beings through the realm of phenomena, the limit of reality, the absence of cessation, the unadulterated suchness, the realm of phenomena devoid of engagement, the ultimate emptiness, and the nonregressing sameness of all phenomena. He is endowed with the conduct of perpetual wisdom, and he apprehends what is genuine.

source: ཡང་དག་པར་དམིགས་པའི་དེ་བཞིན་གཤེགས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་སྤྱོད་པ་དག་ལ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ། སེམས་ནམ་མཁའ་དང་མཉམ་ཞིང་མཚུངས་པ། མ་ཆགས་པའི་ཡེ་ཤེས་མཉམ་པ་ཉིད་ཐོབ་པ། ལྟ་བ་ཐམས་ཅད་ཀྱི་བག་ཆགས་ཀྱི་ཉོན་མོངས་པ་ཡང་དག་པར་བཅོམ་པ་རྣམས་ལ་ཚངས་པའི་གནས་པ་དམིགས་པ་མེད་པ་སྟོན་ཏོ།
en: Right now, this thus-gone one teaches the sublime states devoid of reference point to the bodhisattva great beings who have fully trained in the practices of the six perfections, whose minds are equal to space, who have reached the sameness of unattached wisdom, and who have truly overcome the afflictions associated with the latent tendencies of all views.”

source: །ཀྱེ་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་བསྟན་པ་འདི་བཤད་པ་ན་ཡང་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཀླུའི་རྒྱལ་པོ་ལུས་འབིགས་པའི་ཁབ་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཟླ་བ་ལ་རྩུབ་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་རིན་ཆེན་སྐྱོང་ཞེས་བྱ་བ་དེ་དག་བྱང་ཆུབ་ཀྱི་སྤྱོད་པའི་དགེ་བའི་རྩ་བ་སྔོན་བསགས་པའི་སྨོན་ལམ་ཡང་དག་པར་རྗེས་སུ་དྲན་པས་དེ་དག་སྣང་བ་དང་། རྣམ་པར་བསྒྱིངས་པ་དང་ལྡན་པའི་གཟུངས་ཐོབ་པར་གྱུར་ཏོ།
en: Oh! As this teaching was being given by the sage Jyotīrasa, the nāga king Sāgara and the nāga kings Body-Piercing Needle, Harsh to the Moon, and Precious Protector remembered the roots of virtue and aspirations related to the bodhisattva conduct they had accumulated in the past, and they achieved recall endowed with insight and composure.

source: །དེའི་ཚེ་ཀླུ་གཞན་བརྒྱད་ཅུ་རྩ་བཞི་ནི་བྱང་ཆུབ་ཀྱི་སྤྱོད་པའི་དགེ་བའི་རྩ་བ་སྔོན་བསགས་པའི་སྨོན་ལམ་ཡང་དག་པར་རྗེས་སུ་དྲན་པས་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ། །
en: At that time, eighty-four other nāgas also remembered the roots of virtue and aspirations related to the bodhisattva conduct they had accumulated in the past, and they achieved the absorption that does not forget the mind of awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་སྐར་མ་ལ་དགའ་བ་ལ་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱོད་བཞུད་ལ་སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པ་གང་གིས་འདིར་བདག་ཅག་བདུད་ཀྱི་འཆིང་བ་འདི་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པའི་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པ་དེ་ལ་བདག་ཅག་གི་ཚིག་གིས་གསོལ་བ་ཐོབ་ཤིག །དེ་བཞིན་དུ་བྱའོ་ཞེས་སྨྲས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བ་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་འཁོར་དྲང་སྲོང་སྟོང་ཕྲག་མང་པོ་དང་དེ་ནས་རྫུ་འཕྲུལ་གྱིས་སོང་ངོ་།
en: They said to the bodhisattva Jyotīrasa, “Please take our message to supplicate the compassionate Thus-Gone One, who has developed great compassion such that he can free us from the bondages of the māras in this place!” “I shall do so!” replied the bodhisattva great being Jyotīrasa, and he miraculously left that place in the appearance of a sage and with a retinue of many thousands of sages.

source: །འཕགས་པ་འདུས་པ་ཆེན་པོའི་སྡེ་ཐེག་པ་ཆེན་པོའི་མདོ་ལས་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་ལས་བརྒྱད་པའོ།། །།
en: This concludes the eighth among the eleven chapters included in “The Quintessence of the Sun ,” the noble Great Vehicle discourse of The Great Assembly.

source: བཅོམ་ལྡན་འདས་ལ་ཀླུ་ཐམས་ཅད་སྐྱབས་སུ་ཉེ་བར་གནས་པ་བདུད་སྡིག་ཅན་གྱིས་ཐོས་ཏེ། ཤས་ཆེར་འཁྲུགས་ཤིང་སྐྲག་ལ་རྒྱ་ཤུག་གི་འདབ་མ་བཞིན་དུ་ལུས་རབ་ཏུ་འདར་ཞིང་ལུས་རྔུལ་ནས་ལག་པ་གཉིས་བསྒྲེང་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When the evil Māra saw that all the nāgas had taken refuge in the Blessed One, he became exceedingly distressed and scared, and his body began to shake like the leaves of a jujube tree. Sweating, he raised his two hands and lamented:

source: །ལག་འགྲོ་རྣམས་ནི་སྐྱབས་སུ་དོང་།
en: “The nāgas have gone for refuge.

source: །སྐྱེ་དགུ་ཐམས་ཅད་རྨོངས་གྱུར་ཅིང་།
en: All beings have become deluded

source: །འཆི་མེད་ལམ་ལ་གཞོག་བྱེད་པ།
en: And placed on the path of immortality.

source: །མི་ཟད་གཡོ་སྒྱུ་ཅན་ལ་ལྟོས།
en: Look at this endless deceit!”

source: །དེའི་ཚེ་ན་བདུད་ཀྱི་བུ་མོ་མུན་བྲལ་མ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The daughter of Māra named Free of Darkness said:

source: །སེམས་ཅན་གང་དག་ཐོས་ཙམ་གྱིས། །དགེ་སྦྱོང་ལ་ནི་སྐྱབས་སུ་མཆིས།
en: “Sentient beings go for refuge in that spiritual practitioner Just by hearing about him.

source: །གང་དག་དེ་ཡི་ཚིག་ཐོས་ཤིང་། །དེ་མཐོང་བ་ལྟ་སྨོས་ཅི་འཚལ།
en: They do so by merely hearing such words, Not to mention seeing him!

source: །བརྩོན་འགྲུས་སྣ་ཚོགས་སྦྱོར་བ་ཡིས། །ཁྱོད་ཀྱིས་ཡུན་ནི་རིང་དུ་གཟིགས།
en: “You have observed him for a long time While applying all kinds of effort,
